Funcinamento básico Pandas

In [1]:
import pandas as pd

In [3]:
cidades = pd.DataFrame(
    [
        ['Paraná', 'Londrina', 575377, 1356.00],
        ['São Paulo', 'São Carlos', 254484, 1508.00],
        ['Santa Catarina', 'Florianópolis', 508826, 1798.00],
        ['Paraná', 'Curitiba', 1963726, 2293.00],
        ['São Paulo', 'Campinas', 1223237, 1710.0]
    ], columns=['Estado', 'Cidade', 'Habitantes', 'Salário-Médio'])
#Ou poderia ser usado:
#df = pd.read_csv('cidades.csv', sep = ',', header = 0)
cidades

           Estado         Cidade  Habitantes  Salário-Médio
0          Paraná       Londrina      575377         1356.0
1       São Paulo     São Carlos      254484         1508.0
2  Santa Catarina  Florianópolis      508826         1798.0
3          Paraná       Curitiba     1963726         2293.0
4       São Paulo       Campinas     1223237         1710.0

In [6]:
print(cidades.head(2)) #retorna as duas primeiras linhas
print('\n')
print(cidades.tail(2)) #retorna as duas últimas linhas

      Estado      Cidade  Habitantes  Salário-Médio
0     Paraná    Londrina      575377         1356.0
1  São Paulo  São Carlos      254484         1508.0


      Estado    Cidade  Habitantes  Salário-Médio
3     Paraná  Curitiba     1963726         2293.0
4  São Paulo  Campinas     1223237         1710.0

In [7]:
cidades.shape #retorna tupla com n° de linhas e colunas

(5, 4)

In [11]:
cidades.info() #retorna vazio e printa informações relevantes do dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Estado         5 non-null      object
 1   Cidade         5 non-null      object
 2   Habitantes     5 non-null      int64
 3   Salário-Médio  5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [17]:
print(cidades.columns) #Retorna lista com nome de todos os atributos
cidades.columns[2]

Index(['Estado', 'Cidade', 'Habitantes', 'Salário-Médio'], dtype='object')

'Habitantes'

In [18]:
cidades['Salário-Médio'].describe() #retorna dataframe com estatísticas da coluna

count       5.000000
mean     1733.000000
std       357.459089
min      1356.000000
25%      1508.000000
50%      1710.000000
75%      1798.000000
max      2293.000000
Name: Salário-Médio, dtype: float64

In [19]:
cidades['Habitantes'] = cidades['Habitantes'].astype('float64') #Altera classe de uma coluna
cidades.dtypes

Estado            object
Cidade            object
Habitantes       float64
Salário-Médio    float64
dtype: object

In [20]:
cidadesHab = cidades[['Habitantes', 'Salário-Médio']] #Pegar somente colunas específicas
cidadesHab

   Habitantes  Salário-Médio
0    575377.0         1356.0
1    254484.0         1508.0
2    508826.0         1798.0
3   1963726.0         2293.0
4   1223237.0         1710.0

In [22]:
cidades.iloc[1:3, 1:] #Seleciona as linhas e colunas pelos índices

          Cidade  Habitantes  Salário-Médio
1     São Carlos    254484.0         1508.0
2  Florianópolis    508826.0         1798.0

In [26]:
cidades.insert(2, 'Sigla', ['PR', 'SP', 'SC', 'PR', 'SP']) #insere nova coluna
cidades

           Estado         Cidade Sigla  Habitantes  Salário-Médio
0          Paraná       Londrina    PR    575377.0         1356.0
1       São Paulo     São Carlos    SP    254484.0         1508.0
2  Santa Catarina  Florianópolis    SC    508826.0         1798.0
3          Paraná       Curitiba    PR   1963726.0         2293.0
4       São Paulo       Campinas    SP   1223237.0         1710.0

In [27]:
print(cidades.pop('Sigla')) #deleta e retorna a coluna
cidades

0    PR
1    SP
2    SC
3    PR
4    SP
Name: Sigla, dtype: object

           Estado         Cidade  Habitantes  Salário-Médio
0          Paraná       Londrina    575377.0         1356.0
1       São Paulo     São Carlos    254484.0         1508.0
2  Santa Catarina  Florianópolis    508826.0         1798.0
3          Paraná       Curitiba   1963726.0         2293.0
4       São Paulo       Campinas   1223237.0         1710.0

Operações

In [32]:
cidades.query('`Salário-Médio` > 1510.0') #Retorna elementos que preenchem a condição

           Estado         Cidade  Habitantes  Salário-Médio
2  Santa Catarina  Florianópolis    508826.0         1798.0
3          Paraná       Curitiba   1963726.0         2293.0
4       São Paulo       Campinas   1223237.0         1710.0

In [33]:
cidades.query('Estado == "São Paulo" and Habitantes > 1000000')

      Estado    Cidade  Habitantes  Salário-Médio
4  São Paulo  Campinas   1223237.0         1710.0

In [34]:
cidades.sort_values(by='Cidade', inplace=True) #Ordena pelos valores da coluna
cidades

           Estado         Cidade  Habitantes  Salário-Médio
4       São Paulo       Campinas   1223237.0         1710.0
3          Paraná       Curitiba   1963726.0         2293.0
2  Santa Catarina  Florianópolis    508826.0         1798.0
0          Paraná       Londrina    575377.0         1356.0
1       São Paulo     São Carlos    254484.0         1508.0

In [35]:
numeros_cardinalidade = pd.DataFrame(
    [
        [1, 'ímpar'],
        [2, 'par'],
        [3, 'ímpar'],
        [4, 'par']
    ], columns=['Número', 'Cardinalidade'])

numeros_primo = pd.DataFrame(
    [
        [2, 'S'],
        [3, 'S'],
        [4, 'N'],
        [7, 'S']
    ], columns=['Número', 'Primo'])

In [38]:
pd.merge(left=numeros_cardinalidade, right=numeros_primo, on="Número", how="outer")
#Juntar dois frameworks. left right são as posições, on a interseção e how="outer" significa que é pra 
#manter linhas que tem objetos faltando

   Número Cardinalidade Primo
0       1         ímpar   NaN
1       2           par     S
2       3         ímpar     S
3       4           par     N
4       7           NaN     S

In [41]:
numeros1 = pd.DataFrame(
    [
        [1, 'ímpar'],
        [2, 'par']
    ], columns=['Número', 'Cardinalidade'])
numeros2 = pd.DataFrame(
    [
        [2, 'par'],
        [3, 'ímpar']
    ], columns=['Número', 'Cardinalidade'])

In [44]:
pd.concat([numeros1, numeros2], ignore_index=True)
#Junta frameworks que se complementam. Atenção, não tira repetidos!

   Número Cardinalidade
0       1         ímpar
1       2           par
2       2           par
3       3         ímpar

In [45]:
cidades.to_csv("cidades.csv") #Para salvar arquivo com framework